export const textContent = {
  links: {
    oferta: {
      title: "Публічна\nОферта",
      href: "/contacts/oferta",
    },
    confidentialityPolicy: {
      title: "Політика\nКонфідеційності",
      href: "/contacts/confidentialityPolicy",
    },
  },
  plate: {
    oferta: {
      tittle: "Публічна оферта",
      caption:
        "Придбання послуг на цьому сайті означає акцептацію послуг публічного договору-оферти. Умови надання послуг визначаються договором-офертою.",
    },
    confidentialityPolicy: {
      tittle: "Політика Конфідеційності",
      caption:
        "Ми прагнемо захищати конфіденційність персональних даних, тим самим створивши і забезпечивши максимально комфортні умови використання сервісів Сайту кожному користувачеві.",
    },
  },
};
