import { Typography } from "@/components";

export const textContent = {
  contactsBlock: {
    header: "НАШІ КОНТАКТИ",
    image: "/images/contacts.png",
    card1: {
      section1: {
        tittle: "Телефон:",
        caption1: "+38 (067) 548 09 27",
        caption2: "+38 (067) 864 62 30",
      },
      section2: {
        tittle: "Консультації:",
        caption1: "ПН-ПТ: з 8:00 до 18:00",
      },
    },
    card2: {
      tittle: "E-mail:",
      caption1: "tanpopo.touch@gmail.com",
      caption2: (
        <>
          Онлайн-школа японської мови.{" "}
          <span style={{ fontSize: "14px" }}>
            ©2023 TanPoPo. Всі права захищено.
          </span>
        </>
      ),
    },
    card3: {
      section1: {
        tittle: "Публічна Оферта",
        href: "/contacts/oferta",
      },
      section2: {
        tittle: "Політика Конфідеційності",
        href: "/contacts/confidentiality-policy",
      },
      section3: {
        tittle: "Сторінка Розробників",
        href: "/contacts/developers",
      },
      section4: {
        tittle: "Реквізити Школи",
        href: "/contacts/requisites",
      },
    },
  },
  videoGuidesBlock: {
    divider: {
      line1: "ВІДЕОГАЙДИ",
      line2: "по користуванню сайтом".toUpperCase(),
    },
    cards: [
      {
        caption: (
          <>
            ЯК ПРОХОДИТЬ НАВЧАННЯ
            <br />
            НА НАШІЙ ПЛАТФОРМІ У ФОРМАТІ:
            <br />
            {<b>ОНЛАЙН-КУРСИ З СЕНСЕЯМИ?</b>}
          </>
        ),
        href: "",
        background:
          " linear-gradient(180deg, #FFEDAD 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            <b>КУРСИ ДЛЯ САМОСТІЙНОГО ВИВЧЕННЯ:</b> ОПЛАТА, РЕЄСТРАЦІЯ ТА
            ПОЧАТОК НАВЧАННЯ.
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #FFADB7 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            <b>ОНЛАЙН-КУРСИ З СЕНСЕЄМ:</b> ОПЛАТА, РЕЄСТРАЦІЯ ТА <br /> ПОЧАТОК
            НАВЧАННЯ.
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #E5ADFF 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            <b>АКТИВАЦІЯ</b> ТА <br /> <b>ЗАМОРОЗКА</b> КУРСІВ <br /> В
            ОСОБИСТОМУ КАБІНЕТІ
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #DBFFAD 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            ЯК КОРИСТУВАТИСЬ <br /> НАШОЮ ПЛАТФОРМОЮ <br />
            <b>TANPOPO ALL-IN-ONE?</b>
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #F4ADFF 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            <b>КОМУНІКАЦІЯ З СЕНСЕЄМ</b> <br /> ТА ПЕРЕВІРКА ДОМАШНІХ <br />{" "}
            ЗАВДАНЬ НА НАШІЙ ПЛАТФОРМІ
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #ADBFFF 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            ЯК СКОРИСТАТИСЯ <br /> <b>ЗНИЖКАМИ НА ТОВАРИ</b> <br /> НАШИХ
            ПАРТНЕРІВ?
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #ADF5FF 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            ЯК СКОРИСТАТИСЯ <br /> <b>ПРОМОКОДАМИ НА ЗНИЖКУ</b> <br />
            ДЛЯ ПРОДУКЦІЇ TANPOPO?
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #ADFFCE 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
      {
        caption: (
          <>
            ЯК ПРИДБАТИ ТА АКТИВУВАТИ <br />
            <b>
              ПОДАУРНКОВИЙ СЕРТИФІКАТ <br />
            </b>
            НА ОБРАНИЙ КУРС?
          </>
        ),
        href: "",
        background:
          "linear-gradient(180deg, #FDFFAD 0%, rgba(255, 255, 255, 0.00) 100%)",
      },
    ],
  },
  faqBlock: {
    divider: { line1: "АКТУАЛЬНІ ПИТАННЯ" },
    questions: [
      {
        question: "З вами можна зв’язатись у будь-який час?",
        answer:
          "Онлайн-школа TanPoPo та наша платформа All-in-One працює у режимі 24/7.\n\nАле якщо у вас виникли запитання і ви бажаєте з’ясувати їх у телефонному режимі, будь ласка, скористайтесь нашими робочими годинами: ПН-СБ. з 8:00 до 20:00.\n\nВи також можете легко заповнити контакту форму зверху цієї сторінки або сконтактувати з нами через Email чи вищезазначені месенджери і ми відповімо Вам, як тільки у нас з’явиться можливість!",
      },
      {
        question:
          "Чи є можливість консультацій з викладачами під час навчання?",
        answer:
          'Так, ми надаємо можливість консультацій з нашими викладачами, коли обрано будь-який "Онлайн-курс з сенсеєм".',
      },
      {
        question:
          "Чи є у вас фізичне місце розташування, де можна зустрітися особисто?",
        answer:
          "На жаль, у нас немає фізичного офісу, адже ми працюємо в онлайн форматі. Однак ми завжди готові відповісти на ваші запити онлайн!",
      },
      {
        question:
          "Чи є у вас соціальні мережі, де я можу слідкувати за оновленнями?",
        answer:
          "Так, ми активні в соціальних мережах. Ви можете слідкувати за нами на Instagram або YouTube, щоб бути в курсі наших останніх новин та акцій.",
      },
      {
        question: "Як дізнатися більше про вашу команду та викладачів?",
        answer:
          'Інформацію про нашу команду та викладачів ви можете знайти на сторінці "Про Школу" нашого веб-сайту.',
      },
    ],
  },
};
