import { getIconArtSrc } from "@/helpers";

export const textContent = {
  title: (
    <>
      Придбаючи будь-який наш онлайн-курс з сенсеєм або відеокурс чи аудіокурс,
      <br />
      окрім крутих матеріалів, сучасних методик та всіх переваг нашого навчання{" "}
      <br />
      <b> Ви також отримуєте</b>:
    </>
  ),
  cards: [
    {
      title: "Усі можливості платформи!",
      image: getIconArtSrc("temple"),
      indexBg: "#FCC",
      caption:
        "Потужна інтерактивна платформа дозволяє вивчати мову легко, зручно та ефективно! Знаходьте та переглядайте всю необхідну інформацію у вашому Особистому Кабінеті: розклад занять; ваші курси; чат з викладачем(для онлайн-курсів з сенсеєм); завантажуйте навчальні матеріали; виконуйте інтерактивні домашні завдання прямо на платформі та відкривайте інші можливості!",
    },
    {
      title: "Повний доступ до Бібліотеки TanPoPo",
      image: getIconArtSrc("book1"),
      indexBg: "#FFF0C9",
      caption:
        "Ми зібрали усі найкращі та найцікавіші додаткові мате-ріали, які можуть знадобитися при вивченні японської мови! Більшість - наші власні авто-рські збірки, а також матеріали, що нам вдалось віднайти за багато років власного вивчення мови! Тому це місце - чудова знахідка для всіх, хто бажає дізнаватись нові цікавинки про японську мову, адже щоразу ми додаємо щось новеньке! ",
    },
    {
      title: "10% знижки на ВСІ наші авторські продукти",
      image: getIconArtSrc("store"),
      indexBg: "#DAFFD1",
      caption: (
        <>
          Поверх будь-якої акції або наявної знижки на продукти TanPoPo наші
          учні отримують <u>додаткові 10% знижки</u> на всі наявні товари!
          Обирайте бажаний курс, реєструйтеся та оплачуйте свої перші заняття,
          після чого у власному кабінеті Ви знайдете промокод на додаткову
          знижку! Кожний наш продукт створений з любов’ю командою TanPoPo, щоб
          надихати українців вивчати японську мову!
        </>
      ),
    },
    {
      title: "Знижки на товари наших партнерів",
      image: getIconArtSrc("shopCart"),
      indexBg: "#D2F4FF",
      caption: (
        <>
          В нашій Крамничці знаходьте відділ “Магазини Партнерів”, де Ви
          побачите додаткові <u>знижки на ВЕСЬ асортимент товарів</u> наших
          партнерів екслюзивно для учнів нашої школи! Ви можете стежити за
          цікавим для вас магазинчиком в соц. меражах, щоб не пропустити нових
          надходжень або брати участь в крутих розіграшах! Промокоди на знижки
          знаходьте у своєму Особистому Кабінеті.
        </>
      ),
    },
    {
      title: "Сертифікат після проходження курсу",
      image: getIconArtSrc("certificate1"),
      indexBg: "#E2D4FF",
      caption:
        "Отримуйте сертифікат від школи TanPoPo на обраний курс, який підтверджує його успішне проходження і ваші нові скіли та навички! В кінці курсу проходьте фінальний тест, щоб підтве-рдити ваші реальні знання, після чого в Особистому Кабінеті з’явиться ваш іменний онлайн-сертифікат про успішне прохо-дження обраного курсу, який можна буде також завантажити в електронному вигляді!",
    },
    {
      title: "Комунікація з сенсеями навіть після заняття",
      image: getIconArtSrc("laptop1"),
      indexBg: "#FFD4FD",
      caption:
        "Обираючи онлайн-курси з сенсеєм, Ви отримуєте велику перевагу нашого навчання в “Live” спілкуванні! Зробивши ваше домашнє завдання, сенсеї ретельно все перевірять та допоможуть уточнити всі незрозумілі моменти! Якщо у вас виникають додаткові запитання стосовно японської мови навіть поза заняттями у робочий час - наші сенсеї завжди на зв’язку та готові допомогти! ",
    },
  ],
};
