"use client";
import React from "react";
import { ContentCard, Typography } from "@/components";
import { getIconArtSrc } from "@/helpers";
import Image from "next/image";
import cl from "./about.module.scss";

type Properties = {
  format?: "Міні-група" | "Індивідуально" | null;
};

const About: React.FC<Properties> = ({ format }) => {
  return (
    <ContentCard className={cl.important} width="850px">
      <Typography variant="h6">Важливо знати! Формування Розкладу:</Typography>
      <Image
        src={getIconArtSrc("calendar3")}
        alt="Calendar icon"
        width={106}
        height={115}
      />
      <ul className={cl.list}>
        <li>
          {format === "Міні-група" ? (
            <>
              З моменту оплати обраного вами курсу нам потрібно до 14 днів, щоб
              сформувати міні-групу за зручним для всіх розкладом!{" "}
              <u>Зазвичай, це займає меншу кількість часу!</u> Ми вказуємо саме
              такий проміжок, щоб в нас була можливість погодити та сформувати
              єдиний для всіх графік занять! Протягом цього терміну ми
              обов’язково сконтактуємо з Вами, щоб фінально погодити розклад!
            </>
          ) : (
            <>
              З моменту оплати обраного вами курсу нам потрібно до 7 днів, щоб
              сформувати Ваш особистий розклад!{" "}
              <u>Зазвичай, це займає меншу кількість часу!</u> Ми вказуємо саме
              такий проміжок, щоб в нас була можливість погодити та сформувати
              зручний для всіх графік занять! Протягом цього терміну ми
              обов’язково сконтактуємо з Вами, щоб фінально погодити розклад!
            </>
          )}
        </li>
        <li>
          {format === "Міні-група" ? (
            <>
              Якщо протягом 14 днів ми так і не зможемо сформувати міні-групу зі
              зручним розкладом за обраним курсом, Ми гарантуємо Вам повне
              повернення коштів!
            </>
          ) : (
            <>
              Після узгодження з вами графіку навчання, він стає фіксованим.
              Якщо Ви бажаєте змінити к-сть занять на тиждень, нам потрібно буде
              заздалегідь узгодити новий графік занять!
            </>
          )}
        </li>
        <li>
          Після успішного формування та погодження розкладу Ви відразу
          розпочинаєте вивчення японської мови!
        </li>
      </ul>
    </ContentCard>
  );
};

export { About };
