import TeamMemberCard from "@/components/teamMemberCard/teamMemberCard";
import cl from "./page.module.scss";
import getIconArtSrc from "@/helpers/getIconArtSrc";

export default function Home() {
  const teamMember = {
    label: { value: "сенсей", color: "#C1BCFF" },
    name: "Тетяна",
    image: getIconArtSrc("girlStudent"),
    certificates: {
      href: "",
      description: [
        "Більше 7 років викладання",
        "1.5 роки навчання в японському національному університеті Рюкю(Окінава)",
        "1 рік навчання в Кіотському педагогічному університеті.",
        "1 рік тюторства для японських дітей в Японії",
        "2 роки в ролі перекладача",
      ],
    },
    education: {
      level: "JLPT N1.(Найвищий рівень,вільне володіння мовою)",
      university: "Київський націо-нальний університет імені Тараса Шевченка ",
      trainings: "Japanese Leaders, STF Teamline, Global teaching online",
    },
    description: {
      lineOne:
        "Пройшовши складний письмовий іспит з японської мови на мене чекав другий етап конкурсного відбору -  співбесіда в посольстві з трьома японцями. На щастя, 2 відбори я пройшла успішно. А це означало, що на мене чекав 1 рік насиченого та цікавого студентського життя в Японії. ",
      lineTwo:
        "Пройшовши складний письмовий іспит з японської мови на мене чекав другий етап конкурсного відбору -  співбесіда в посольстві з трьома японцями. На щастя, 2 відбори я пройшла успішно. А це означало, що на мене чекав 1 рік насиченого та цікавого студентського життя в Японії. Пройшовши складний письмовий іспит з японської мови на мене чекав другий етап конкурсного відбору -  співбесіда в посольстві.",
      lineThree:
        "Пройшовши складний письмовий іспит з японської мови на мене чекав другий етап конкурсного відбору -  співбесіда в посольстві з трьома японцями. На щастя, 2 відбори я пройшла успішно. А це означало, що на мене чекав 1 рік насиченого та цікавого студентського життя в Японії. ",
      lineFour:
        "Пройшовши складний письмовий іспит з японської мови на мене чекав другий етап конкурсного відбору -  співбесіда в посольстві з трьома японцями. На щастя, 2 відбори я пройшла успішно. А це означало, що на мене чекав 1 рік насиченого та цікавого студентського життя в Японії. ",
    },
  };
  return (
    <main className={cl.main}>
      <h1>Home page</h1>
      <TeamMemberCard {...teamMember} />
    </main>
  );
}
