import { socialLinks } from "@/config/config";
import { getIconArtSrc } from "@/helpers";

export const textContent = {
  idea: "Ідея створення школи полягала в тому, щоб зібрати в одному місці все найкраще, що необхідно для легкого, веселого, швидкісного та якісного вивчення японської мови! Ми прагнули створити місце, де кожна людина змогла б знайти для себе свій власний простір та спосіб вивчення японської, який найбільше підходить саме їй! Саме тому було створено TanPoPo!",
  bioCards: {
    card1: {
      p1: {
        bold: "🎏 Моє захоплення японською мовою",
        normal:
          "та культурою ропочалося у 2016 році під час навчання в КНУ ім. Тараса Шевченка. Тоді і зародилася мрія відвідати Японію.",
      },
      p2: {
        bold: "⭐ Потрапити до Японії",
        normal:
          "на той час здавалося нездійсненним через фінансові причини, але я продовжувала навчатися з незмінним ентузіазмом, мріючи одного разу потрапити до країни вранішнього Сонця, і вже тоді відчувала потребу поділитися   своїм захопленням з іншими.",
      },
      p3: {
        bold: "📚 Поглиблюючи свої знання",
        normal:
          "поза університетом, я прагнула взяти участь у програмах посольства Японії в Україні від MEXT. Програми, фінансовані Міністерством освіти Японії, не лише давали можливість обрати японський навчальний заклад, отримувати гідну стипендію, але й відкривали широкі кар'єрні перспективи завдяки їх престижності.",
      },
      p4: {
        bold: "🌏 Після успішного проходження складних іспитів",
        normal:
          "та співбесід на мене чекав рік незабутнього студентського життя в Японії за MEXT програмою “Японська мова та культура”.",
      },
      p5: {
        bold: "🌸 Вибравши Кіотський педагогічний університет(京都教育大学)",
        normal:
          "для свого навчального стажування з 2019 по 2020 рік тривало моє перше навчальне стажування, де я отримала незабутній досвід та створила найкращі студентські спогади.",
      },
    },
    card2: {
      p1: {
        bold: "✈️ Окрім поглибленого навчання",
        normal:
          "з японськими сенсеями та активного студеньського життя, мала нагоду багато подорожувати навіть за межами Кіото. Наприклад, часто їздила до Токіо, Осаки, Нари, Кобе та саме тоді відвідала вперше Окінаву.",
      },
      p2: {
        bold: "🎌 Поміж навчання",
        normal:
          "встигала брати участь у конкурсних відборах промов в Кіото та Осаці, де займала перші місця.",
      },
      p3: {
        bold: "🌻 Мені завжди",
        normal:
          "приносило велике задоволення проводити уроки для японських учнів про Україну та українську культуру.",
      },
      p4: {
        bold: "🧳 Повернувшись до Києва",
        normal:
          "після свого першого стажування, завершила навчання в КНУ та отримала диплом з відзнакою. Моя попередня подорож до Японії спонукала мене вирушити туди знову. Тому, маючи досвід проходження програми, вирішила вдруге полетіти до Японії і знову успішно пройшла відбір за програмою “Стажер-дослідник”. На цей раз я обрала Окінаву і мій улюблений університет Рюкю（琉球大学）, де вивчала інклюзивну освіту на Факультеті гуманітарних та соціальних наук.",
      },
    },

    card3: {
      p1: {
        bold: " 🎎 На Окінаві та у Кіото",
        normal:
          "я мала хост фемілі, які давали мені унікальну можливість пізнати зсередини родинні японські традиції та дізнатися більше про їхні сімейні цінності.",
      },
      p2: {
        bold: "⏳ У вільний час",
        normal:
          "подобалося підпрацьовувати викладачем та гідом для японських школярів з інших префектур. Також, окрім викладацької роботи, у мене є важливий досвід у сфері усного перекладу, коли я неодноразово працювала усним перекладачем під час різних заходів і зустрічей між українцями та японцями.",
      },
      p3: {
        bold: "🏆 Моє навчання в Японії",
        normal:
          "було кроком до моєї наступної мрії - відкриття школи японської мови TanPoPo! Ця ідея зародилася майже відразу, ставши сенсеєм. За ці 7 років я навчала різних учнів: дітей, дорослих, іноземців та навіть самих японців. Всі учні дуже різні, але всі чудові! Кожен із них - моя гордість! ",
      },
      p4: {
        bold: "💛 Найбільшу цінність",
        normal:
          "завжди вбачала у викладанні японської мови саме для українців. Велика ціль для мене полягає в популяризації японістики на теренах України, прагну надихнути українців вивчати японську мову та культуру. І таким чином, теж бажаю донести наше культурне багатство і до самих японців! Саме тому запрошую усіх у кого є бажання пізнавати та вивчати японську мову та культуру - долучатися!",
      },
    },
  },
  infoCards: [
    {
      title: "Рівнева перевірка на знання японської мови.",
      image: getIconArtSrc("magnifierGlassRight"),
      text: "У нашій школі ми зосереджуємося на навчанні як учнів, так і викладачів. Кожен претендент, який бажає стати учителем, мусить пройти спеціальну Рівневу Перевірку. Наш академ-менеджер ретельно відбирає сенсеїв, зважаючи на їхні знання японської мови, психологічні особливості та інші фактори.",
    },
    {
      title: "Наша місія як викладачів і вчителів:",
      image: getIconArtSrc("tower1"),
      text: "Наші викладачі є не лише молодими і енергійними фахівцями, а й справжніми професіоналами своєї справи. Ми пишаємося нашим досвідом та знаннями, які передаємо своїм учням, забезпечуючи якісну освіту на всіх рівнях навчання і продовжуємо докладати максимум зусиль для їхнього навчання та успіху!",
    },
    {
      title: "Надихаємо на нові досягнення!",
      image: getIconArtSrc("rocket1"),
      text: "Ми завжди знаходимось в пошуках нових талантів, тому якщо ти - людина з гарними знаннями японської мови та бажанням викладати - будемо раді дізнатись про тебе більше:",
    },
  ],
  reviewsBlock: {
    header: "ВІДГУКИ ПРО ШКОЛУ",
    caption:
      "Дізнайтеся від наших учнів як \n проходить навчання в школі TanPoPo!",
  },
  partnersBlock: {
    header: "НАШІ ПАРТНЕРИ",
    title:
      "Ми об’єднуємо зусилля, поширюючи японську мову та культуру в Україні, роблячи її все більш доступною для кожного, хто бажає її вивчати!",
    caption:
      "Наші партнери та компанії, які обирають онлайн-школу TanPoPo та довіряють нам своїх клієнтів/працівників для досконалого вивчення японської мови. Разом ми формуємо нову спільноту мовного вдосконалення та японської культури в Україні!",
  },
  authorContentBlock: {
    header: "АВТОРСЬКИЙ КОНТЕНТ",
    instagram: {
      title: "Щоденний навчально-розважальний контент в Інстагромі:",
      iconLink: socialLinks.instagram,
      links: [
        socialLinks.instagram,
        socialLinks.instagram,
        socialLinks.instagram,
      ],
      images: ["/instagram/1.png", "/instagram/2.png", "/instagram/3.png"],
      caption:
        "Сторіз з повсякденними публікаціями з життя в Японії та України; цікаві пости на вивчення фраз та слів з японсько-українським перекладом; розбір значення канджі на радикали; круті навчальні рілси для простого та швидкого вивчення слів та багато-багато іншого!",
    },
    youtube: {
      title: "Все про Японію та японців узахопливому відеоформаті в Ютюбі:",
      iconLink: socialLinks.youTube,
      links: [socialLinks.youTube, socialLinks.youTube, socialLinks.youTube],
      images: ["/youtube/1.jpeg", "/youtube/2.jpeg", "/youtube/3.jpeg"],
      caption:
        "На нашому каналі Ви побачите, все про життя звичайних японців на їхній рідній землі очима українки! Походите вайбовими вуличками Японії, скуштуєте смачну їжу, зазирнете в японські університети, побачите, як живуть та навчаються японські студенти. Давайте разом подорожувати всією Японію!",
    },
  },
  reelsBlock: {
    header: "НАВЧАЛЬНІ REELS",
    images: [
      {
        href: "https://www.instagram.com/reel/C1Y1TzdtAlb/",
        image: "/reels/Reels1.png",
      },
      {
        href: "https://www.instagram.com/reel/CpwiZqsrjP3/",
        image: "/reels/Reels2.png",
      },
      {
        href: "https://www.instagram.com/reel/Csc5T2jMx0Z/",
        image: "/reels/Reels3.png",
      },
      {
        href: "https://www.instagram.com/reel/Cr7bwWdvRA8/",
        image: "/reels/Reels4.png",
      },
      {
        href: "https://www.instagram.com/reel/CulqihrtOfN/",
        image: "/reels/Reels5.png",
      },
      {
        href: "https://www.instagram.com/reel/CqcU5WuJUyW/",
        image: "/reels/Reels6.png",
      },
      {
        href: "https://www.instagram.com/reel/CpZm7ShAgOC/",
        image: "/reels/Reels7.png",
      },
    ],
    caption:
      "Ще більше навчальних Reels та інших матеріалів Ви можете знайти в нашій Бібліотеці TanPoPo, де ми зібрали велику кількість корисних сайтів, підручників, відео/фото матеріалів та багато-багато іншого для швидкісного вивчення японської мови!",
    button: "Бібліотека",
  },
  linkCardsBlock: [
    {
      title:
        "Завітайте до нашої крамниці, де знайдете багато крутих і корисних навчальних продуктів!",
      image: getIconArtSrc("store"),
      button: {
        text: "Крамниця",
        href: "/shop",
        icon: "shop",
      },
    },
    {
      title:
        "Бажаєте дізнатись детальніше про наші курси, заняття, відеоматеріали та багато іншого?",
      image: getIconArtSrc("temple"),
      button: {
        text: "Курси",
        href: "/courses",
        icon: "bookPlay",
      },
    },
    {
      title:
        "Цікавить вартість курсів? Ми завжди намагаємось давати лише привабливі цінові пропозиції!",
      image: getIconArtSrc("coinsStack"),
      button: {
        text: "Вартість",
        href: "/prices",
        icon: "coinsStack",
      },
    },
  ],
};
