import { getIconArtSrc } from "@/helpers";

export const textContent = {
  dealBlock: {
    titleCard: "Для учнів школи\nTanPoPo💛",
    cards: [
      {
        title: (
          <>
            Знижка <b>10%</b> на всі товари <br/>в нашій Крамниці!
          </>
        ),
        image: getIconArtSrc("presentBox3"),
        caption: (
          <>
            Поверх будь-якої акції або наявної знижки на продукти TanPoPo наші
            учні отримують <u> додаткові 10%</u> знижки на всі наявні товари!
            Обирайте бажаний курс, реєструйтеся та оплачуйте свої перші заняття,
            після чого в Особистому Кабінеті Ви знайдете промо-код на знижку та
            зможете скористатись ним під час оформлення замовлення!
          </>
        ),
      },
      {
        title: "Екслюзивні знижки на ВСІ\nтовари наших партнерів!",
        image: getIconArtSrc("shopCart"),
        caption: (
          <>
            Отримуйте додаткові <u> знижки на ВЕСЬ асортимент товарів</u> наших
            партнерів! Ви можете стежити за цікавим для вас магазинчиком в соц.
            меражах, щоб не пропустити нових надходжень або взяти участь в
            крутих розіграшах! Промокоди на знижки знаходьте в Особистому
            Кабінеті після активації обраного курсу!
          </>
        ),
      },
    ],
  },
};
